In [53]:
import numpy as np
import pandas as pd
from sklearn import tree
from sklearn import preprocessing

In [54]:
data=pd.read_csv("C:/Users/harish/Desktop/LETS UPGRADE/titanic dataset/train.csv")
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [55]:
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [56]:
data1=np.where(data["Age"].isnull(),27,data["Age"])
data["Age"]=data1

In [62]:
data["Cabin"].fillna(method="ffill",inplace=True)

In [63]:
data["Cabin"].isnull().sum()

0

In [64]:
data.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       2
dtype: int64

In [84]:
label=preprocessing.LabelEncoder()

In [86]:
data["Sex"]=label.fit_transform(data["Sex"])

In [87]:
from sklearn.ensemble import RandomForestClassifier

In [88]:
rf=RandomForestClassifier(n_estimators=100,max_features=2,oob_score=True)

In [91]:
features=["PassengerId","Pclass","Sex","Age","SibSp","Parch","Fare"]

In [92]:
rf.fit(X=data[features],y=data["Survived"])

RandomForestClassifier(bootstrap=True, ccp_alpha=0.0, class_weight=None,
                       criterion='gini', max_depth=None, max_features=2,
                       max_leaf_nodes=None, max_samples=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=100,
                       n_jobs=None, oob_score=True, random_state=None,
                       verbose=0, warm_start=False)

In [93]:
print(rf.oob_score_)

0.8204264870931538

In [94]:
for feature,imp in zip(features,rf.feature_importances_):
    print(feature,imp);

PassengerId 0.20849604673894312
Pclass 0.07881264384462798
Sex 0.24351157487799838
Age 0.1736299980781698
SibSp 0.04550433419159582
Parch 0.03181603481878831
Fare 0.21822936744987648

In [95]:
tm1=tree.DecisionTreeClassifier(max_depth=8)

In [141]:
preds=pd.DataFrame([data["Sex"],data["Age"],data["Fare"]]).T

In [158]:
tm1.fit(X=preds,y=data["Survived"])

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=8, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [159]:
with open("dtree6.dot",'w')as f:
    f=tree.export_graphviz(tm1,feature_names=["Sex","Age","Fare"],out_file=f);

In [160]:
tm1.score(X=preds,y=data["Survived"])

0.877665544332211

In [161]:
data4=pd.read_csv("C:/Users/harish/Desktop/LETS UPGRADE/titanic dataset/test.csv")

In [162]:
data4.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [163]:
data4["Sex"]=label.fit_transform(data4["Sex"])

In [164]:
dt=np.where(data4["Age"].isnull(),27,data4["Age"])
data4["Age"]=dt

In [173]:
tpreds=["Sex","Age","Fare"]

In [177]:
data4["Fare"].fillna(method="ffill",inplace=True)

In [179]:
testpred=tm1.predict(X=data4[tpreds])

In [180]:
pred_out=pd.DataFrame({"PassengerId":data4["PassengerId"],"Survived":testpred})

In [182]:
pred_out.to_csv("output.csv",index=False)